ТОИР_демо/src/Enums/торо_СтатусыДокументов/торо_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыДокументов</name>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>ЗапланированоУстранение</name>
  </enumValues>
  <enumValues>
    <name>Устраняется</name>
  </enumValues>
  <enumValues>
    <name>Устранен</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВыявленныеДефекты</name>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <basedOn>Document.торо_СостоянияОбъектовРемонта</basedOn>
  <basedOn>Document.торо_УчетКонтролируемыхПоказателей</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <attributes>
      <name>ВидДефекта</name>
      <type>
        <types>CatalogRef.торо_ВидыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <type>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйОбъект</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныеЛица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/CommonModules/торо_РаботаСоСтатусамиДокументовПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Получить таблицу порядка статусов документов.
// Параметры:
//   ДокументыОснования - СписокЗначений - список документов оснований.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица с указанием порядка статусов документов, имеет колонки "ТипДокумента" пустая ссылка
//						на документ соответствующего типа,
//						Статус - Статус документа, тип - ПеречислениеСсылка.торо_СтатусыДокументов,
//						Порядок - прядок статусов, тип - число.
Функция ПолучитьТаблицуПорядкаСтатусовДокументов(ДокументыОснования) Экспорт 
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ЗаявкаНаРемонт"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие"));
	
	ТаблицаПорядкаСтатусов = Новый ТаблицаЗначений;
	ТаблицаПорядкаСтатусов.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов(МассивТипов));
	ТаблицаПорядкаСтатусов.Колонки.Добавить("Статус", Новый ОписаниеТипов("ПеречислениеСсылка.торо_СтатусыДокументов"));
	ТаблицаПорядкаСтатусов.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	Для каждого Элем Из ДокументыОснования Цикл
		
		// Порядок статусов выявленных дефектов
		Если ТипЗнч(Элем.Значение) = ТИП("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
			
			Если ТаблицаПорядкаСтатусов.Найти(Документы.торо_ВыявленныеДефекты.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Зарегистрирован;
			НС.Порядок = 0;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.ЗапланированоУстранение;
			НС.Порядок = 1;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Устраняется;
			НС.Порядок = 2;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Устранен;
			НС.Порядок = 3;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Отклонен;
			НС.Порядок = 4;
			
			// Порядок статусов предписаний
		ИначеЕсли ТипЗнч(Элем.Значение) = ТИП("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			
			Если ТаблицаПорядкаСтатусов.Найти(Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Зарегистрирован;
			НС.Порядок = 0;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.ЗапланированоУстранение;
			НС.Порядок = 1;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Устраняется;
			НС.Порядок = 2;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Устранен;
			НС.Порядок = 3;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Отклонен;
			НС.Порядок = 4;
			
			// Порядок статусов заявок на ремонт
		ИначеЕсли ТипЗнч(Элем.Значение) = ТИП("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
			
			Если ТаблицаПорядкаСтатусов.Найти(Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Зарегистрирован;
			НС.Порядок = 0;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Выполняется;
			НС.Порядок = 1;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Выполнен;
			НС.Порядок = 2;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Отклонен;
			НС.Порядок = 3;
			
			// Порядок статусов нарядов на ремонтные работы
		ИначеЕсли ТипЗнч(Элем.Значение) = ТИП("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
			
			Если ТаблицаПорядкаСтатусов.Найти(Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Зарегистрирован;
			НС.Порядок = 0;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Выполнен;
			НС.Порядок = 1;
			
			// Порядок статусов нарядов на мероприятия
		ИначеЕсли ТипЗнч(Элем.Значение) = ТИП("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") Тогда
			
			Если ТаблицаПорядкаСтатусов.Найти(Документы.торо_НарядНаРегламентноеМероприятие.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_НарядНаРегламентноеМероприятие.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Зарегистрирован;
			НС.Порядок = 0;
			
			НС = ТаблицаПорядкаСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_НарядНаРегламентноеМероприятие.ПустаяСсылка();
			НС.Статус = Перечисления.торо_СтатусыДокументов.Выполнен;
			НС.Порядок = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПорядкаСтатусов;
	
КонецФункции

// Функция - Получить таблицу устанавливаемых статусов
//
// Параметры:
//  ТипДокументаСтрока - Строка - Тип документа для которого требуется получить таблицу устанавливаемых статусов.
//									Например: "ДокументСсылка.торо_ВыявленныеДефекты".
//  ДокументыОснования - СписокЗначений - список документов оснований.
//  ЗавершитьРемонтныеРаботы - Булево - Значение флага "Завершить ремонтные работы".
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица устанавливаемых статусов, колонки:
//		ТипДокумента пустая ссылка на документ соответствующего типа для которого устанавливается статус,
//		УстанавливаемыйСтатус, тип - ПеречислениеСсылка.торо_СтатусыДокументов - Статус который устанавливается документу,
//		Порядок, тип - Число - Порядок статуса у документа.
Функция ПолучитьТаблицуУстанавливаемыхСтатусов(ТипДокументаСтрока, ДокументыОснования, ЗавершитьРемонтныеРаботы = Ложь) Экспорт
		
	Если ТипДокументаСтрока = "ДокументСсылка.торо_ЗаявкаНаРемонт" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляЗаявки(ДокументыОснования);
	ИначеЕсли ТипДокументаСтрока = "ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляНаряда(ДокументыОснования);
	ИначеЕсли ТипДокументаСтрока = "ДокументСсылка.торо_АктОВыполненииЭтапаРабот" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляАктаОВыполненииЭтапаРабот(ДокументыОснования, ЗавершитьРемонтныеРаботы);
	ИначеЕсли ТипДокументаСтрока = "ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляАктаОВыполненииРегламентногоМероприятия(ДокументыОснования, ЗавершитьРемонтныеРаботы);
	ИначеЕсли ТипДокументаСтрока = "ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляЗакрытияЗаявокИРемонтов(ДокументыОснования);
	ИначеЕсли ТипДокументаСтрока = "ДокументСсылка.торо_ВыявленныеДефекты" Тогда
		Возврат ПолучитьТаблицуУстанавливаемыхСтатусовДляВыявленныхДефектов(ДокументыОснования);		
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуУстанавливаемыхСтатусовДляЗаявки(ДокументыОснования)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	
	ТаблицаУстанавливаемыхСтатусов = Новый ТаблицаЗначений;
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов(МассивТипов));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("УстанавливаемыйСтатус", Новый ОписаниеТипов("ПеречислениеСсылка.торо_СтатусыДокументов"));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	Для каждого Стр Из ДокументыОснования Цикл
		
		Если ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВыявленныеДефекты.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
			НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.ЗапланированоУстранение;
			НС.Порядок = 1;
		
		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
			НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.ЗапланированоУстранение;
			НС.Порядок = 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаУстанавливаемыхСтатусов;
	
КонецФункции

Функция ПолучитьТаблицуУстанавливаемыхСтатусовДляНаряда(ДокументыОснования)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ЗаявкаНаРемонт"));
	
	ТаблицаУстанавливаемыхСтатусов = Новый ТаблицаЗначений;
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов(МассивТипов));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("УстанавливаемыйСтатус", Новый ОписаниеТипов("ПеречислениеСсылка.торо_СтатусыДокументов"));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	Для каждого Стр Из ДокументыОснования Цикл
		
		Если ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВыявленныеДефекты.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;

			НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
			НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устраняется;
			НС.Порядок = 2;
			
		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
			НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устраняется;
			НС.Порядок = 2;
			
		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;

			НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка();
			НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполняется;
			НС.Порядок = 1; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаУстанавливаемыхСтатусов;
	
КонецФункции

Функция ПолучитьТаблицуУстанавливаемыхСтатусовДляАктаОВыполненииЭтапаРабот(ДокументыОснования, ЗавершитьРемонтныеРаботы)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ЗаявкаНаРемонт"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот"));
	
	ТаблицаУстанавливаемыхСтатусов = Новый ТаблицаЗначений;
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов(МассивТипов));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("УстанавливаемыйСтатус", Новый ОписаниеТипов("ПеречислениеСсылка.торо_СтатусыДокументов"));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	Для каждого Стр Из ДокументыОснования Цикл
		
		Если ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВыявленныеДефекты.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
				
			Если ЗавершитьРемонтныеРаботы Тогда
				
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устранен;
				НС.Порядок = 3;
				
			Иначе
				
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устраняется;
				НС.Порядок = 2;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗавершитьРемонтныеРаботы Тогда
				
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устранен;
				НС.Порядок = 3;
				
			Иначе
				
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устраняется;
				НС.Порядок = 2;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗавершитьРемонтныеРаботы Тогда
				
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
				НС.Порядок = 2;
			Иначе
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполняется;
				НС.Порядок = 1;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗавершитьРемонтныеРаботы Тогда
				
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
				НС.Порядок = 2;
				
			Иначе
				
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполняется;
				НС.Порядок = 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
		
	Возврат ТаблицаУстанавливаемыхСтатусов;

	
КонецФункции

Функция ПолучитьТаблицуУстанавливаемыхСтатусовДляАктаОВыполненииРегламентногоМероприятия(ДокументыОснования, ЗавершитьРемонтныеРаботы)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие"));
	
	ТаблицаУстанавливаемыхСтатусов = Новый ТаблицаЗначений;
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов(МассивТипов));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("УстанавливаемыйСтатус", Новый ОписаниеТипов("ПеречислениеСсылка.торо_СтатусыДокументов"));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	Для каждого Стр Из ДокументыОснования Цикл
		
		Если ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_НарядНаРегламентноеМероприятие.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗавершитьРемонтныеРаботы Тогда
				
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_НарядНаРегламентноеМероприятие.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
				НС.Порядок = 1;
				
			Иначе
				
				НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
				НС.ТипДокумента = Документы.торо_НарядНаРегламентноеМероприятие.ПустаяСсылка();
				НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Зарегистрирован;
				НС.Порядок = 0;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаУстанавливаемыхСтатусов;
	
КонецФункции

Функция ПолучитьТаблицуУстанавливаемыхСтатусовДляЗакрытияЗаявокИРемонтов(ДокументыОснования)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ЗаявкаНаРемонт"));
	
	ТаблицаУстанавливаемыхСтатусов = Новый ТаблицаЗначений;
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов(МассивТипов));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("УстанавливаемыйСтатус", Новый ОписаниеТипов("ПеречислениеСсылка.торо_СтатусыДокументов"));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	Для каждого Стр Из ДокументыОснования Цикл
		
		Если ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВыявленныеДефекты.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка();
			НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Отклонен;
			НС.Порядок = 5;
			
		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
			НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Отклонен;
			НС.Порядок = 5;
			
		ИначеЕсли ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
			
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка();
			НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Отклонен;
			НС.Порядок = 3;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаУстанавливаемыхСтатусов;
	
КонецФункции

Функция ПолучитьТаблицуУстанавливаемыхСтатусовДляВыявленныхДефектов(ДокументыОснования)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	
	ТаблицаУстанавливаемыхСтатусов = Новый ТаблицаЗначений;
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов(МассивТипов));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("УстанавливаемыйСтатус", Новый ОписаниеТипов("ПеречислениеСсылка.торо_СтатусыДокументов"));
	ТаблицаУстанавливаемыхСтатусов.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	Для каждого Стр Из ДокументыОснования Цикл
		
		Если ТипЗнч(Стр.Значение) = ТИП("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			Если ТаблицаУстанавливаемыхСтатусов.Найти(Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС = ТаблицаУстанавливаемыхСтатусов.Добавить();
			НС.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка();
			НС.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Зарегистрирован;
			НС.Порядок = 2;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаУстанавливаемыхСтатусов;
	
КонецФункции

#КонецОбласти
